{
    "articles": [
        {"id": "A12345", "title": "Vaccine guidelines – Dogs", "body": "Updated March 2022. Puppies should start vaccines at 6–8 weeks. Includes distemper, parvovirus, adenovirus, rabies. Booster every 3 years. Rabies schedule may vary by region."},
        {"id": "A12346", "title": "Dental cleaning procedure", "body": "Dental cleaning involves: pre-anesthetic bloodwork, anesthesia, ultrasonic scaling, polishing. FAQ: How long does it take? Usually 45–90 minutes."},
        {"id": "A12347", "title": "Feline Diabetes Mgmt", "body": "Cats with diabetes often present with PU/PD, weight loss, lethargy. Treatment: insulin + dietary control. Monitor blood glucose. Educate owners about hypoglycemia signs."},
        {"id": "A12348", "title": "Equine Colic Management", "body": "Updated July 2021. Colic in horses may result from intestinal obstruction, impaction, or gas buildup. Treatment ranges from medical management with analgesics to surgical intervention."},
        {"id": "A12349", "title": "Canine Parvovirus Treatment", "body": "Updated September 2020. Parvovirus causes severe gastroenteritis in puppies. Supportive care includes IV fluids, antiemetics, and antibiotics. Vaccination is key for prevention."},
        {"id": "A12350", "title": "Avian Nutrition – Parrots", "body": "Updated May 2022. A balanced parrot diet should include pellets, fruits, vegetables, and minimal seeds. Avoid avocado, chocolate, and caffeine due to toxicity."},
        {"id": "A12351", "title": "Rabbit Dental Care", "body": "Updated January 2021. Malocclusion is common in rabbits. Signs include drooling, reduced appetite, and weight loss. Treatment involves regular trimming and dietary adjustment."},
        {"id": "A12352", "title": "Feline Chronic Kidney Disease", "body": "Updated October 2022. Common in older cats. Symptoms include PU/PD, vomiting, and weight loss. Management includes renal diets, phosphate binders, and regular monitoring."},
        {"id": "A12353", "title": "Bovine Mastitis Control", "body": "Updated April 2021. Mastitis is a leading cause of milk loss in dairy cattle. Prevention involves good milking hygiene, culling chronically infected cows, and dry cow therapy."},
        {"id": "A12354", "title": "Goat Internal Parasite Control", "body": "Updated February 2023. Goats are prone to Haemonchus contortus infestation. FAMACHA scoring, pasture rotation, and selective deworming are recommended."},
        {"id": "A12355", "title": "Sheep Foot Rot Management", "body": "Updated November 2021. Caused by Dichelobacter nodosus. Control involves footbaths, culling chronic cases, and vaccination where available."},
        {"id": "A12356", "title": "Canine Hip Dysplasia", "body": "Updated July 2020. Large breed dogs often develop hip dysplasia. Management includes weight control, NSAIDs, physiotherapy, and surgery in severe cases."},
        {"id": "A12357", "title": "Equine Laminitis", "body": "Updated May 2022. Common causes include grain overload and endocrine disorders. Management: dietary restriction, NSAIDs, corrective shoeing, and strict stall rest."},
        {"id": "A12358", "title": "Avian Respiratory Diseases", "body": "Updated December 2022. Birds may develop respiratory distress due to Aspergillosis or bacterial infections. Treatment includes antifungals, antibiotics, and supportive care."},
        {"id": "A12359", "title": "Ferret Adrenal Disease", "body": "Updated June 2021. Signs: alopecia, vulvar swelling, aggression. Treatment: surgical adrenalectomy or deslorelin implant therapy."},
        {"id": "A12360", "title": "Canine Obesity Guidelines", "body": "Updated January 2022. Obesity in dogs leads to diabetes, arthritis, and reduced lifespan. Management: calorie restriction, high-protein diets, and increased exercise."},
        {"id": "A12361", "title": "Feline Hyperthyroidism", "body": "Updated August 2021. Signs: weight loss, hyperactivity, vomiting. Treatments include methimazole, radioactive iodine therapy, or surgical thyroidectomy."},
        {"id": "A12362", "title": "Horse Vaccination Protocols", "body": "Updated March 2023. Core vaccines: tetanus, influenza, EHV, rabies. Boosters every 6–12 months depending on risk."},
        {"id": "A12363", "title": "Piglet Iron Deficiency Anemia", "body": "Updated October 2020. Piglets raised indoors may suffer anemia. Prevention: iron dextran injections within 3–5 days of birth."},
        {"id": "A12364", "title": "Sheep Pregnancy Toxemia", "body": "Updated February 2022. Occurs in late gestation due to inadequate nutrition. Signs: depression, weakness, death. Prevention: proper feeding in ewes carrying multiples."},
        {"id": "A12365", "title": "Canine Epilepsy", "body": "Updated July 2022. Seizures may be idiopathic or secondary. Diagnosis: rule out metabolic and structural causes. Long-term treatment: phenobarbital, potassium bromide, levetiracetam."},
        {"id": "A12366", "title": "Feline Asthma", "body": "Updated September 2021. Signs include wheezing, coughing, and respiratory distress. Treatment includes corticosteroids and bronchodilators."},
        {"id": "A12367", "title": "Equine Dental Care", "body": "Updated June 2020. Horses require floating of teeth every 6–12 months. Sharp enamel points can cause ulcers and poor feed utilization."},
        {"id": "A12368", "title": "Bovine Tuberculosis", "body": "Updated January 2023. A zoonotic disease caused by Mycobacterium bovis. Diagnosis: skin test, gamma interferon assay. Control involves test-and-slaughter programs."},
        {"id": "A12369", "title": "Poultry Newcastle Disease", "body": "Updated October 2022. Highly contagious viral disease in chickens. Signs: coughing, nasal discharge, twisted necks. Control: strict vaccination protocols."},
        {"id": "A12370", "title": "Guinea Pig Vitamin C Deficiency", "body": "Updated April 2021. Guinea pigs require dietary vitamin C. Deficiency leads to scurvy: lethargy, swollen joints, poor wound healing."},
        {"id": "A12371", "title": "Canine Heartworm Disease", "body": "Updated March 2021. Transmitted by mosquitoes. Prevention: monthly ivermectin/milbemycin. Treatment: melarsomine protocol under veterinary supervision."},
        {"id": "A12372", "title": "Feline Lower Urinary Tract Disease", "body": "Updated November 2022. Signs: straining, hematuria, inappropriate urination. Causes: idiopathic cystitis, uroliths. Treatment depends on underlying cause."},
        {"id": "A12373", "title": "Goat Johne's Disease", "body": "Updated August 2020. Chronic wasting disease caused by Mycobacterium avium subspecies paratuberculosis. Control: culling, improved hygiene, and testing."},
        {"id": "A12374", "title": "Sheep Flystrike Prevention", "body": "Updated May 2023. Caused by blowfly larvae. Prevention: crutching, chemical dips, and genetic selection for less wool around breech."},
        {"id": "A12375", "title": "Reptile Metabolic Bone Disease", "body": "Updated February 2021. Caused by calcium/vitamin D3 deficiency. Signs: soft shell, deformities, lethargy. Prevention: UVB lighting + proper diet."},
        {"id": "A12376", "title": "Canine Lyme Disease", "body": "Updated April 2022. Transmitted by Ixodes ticks. Signs: fever, shifting leg lameness, swollen joints. Prevention: tick control, vaccination in endemic regions."},
        {"id": "A12377", "title": "Feline Panleukopenia", "body": "Updated July 2021. Highly contagious viral disease in cats. Signs: vomiting, diarrhea, leukopenia. Prevention: core vaccination."},
        {"id": "A12378", "title": "Equine Strangles", "body": "Updated September 2020. Caused by Streptococcus equi. Signs: fever, nasal discharge, lymph node abscesses. Prevention: quarantine + vaccination."},
        {"id": "A12379", "title": "Rabbit GI Stasis", "body": "Updated January 2023. A common emergency in rabbits. Signs: anorexia, reduced fecal output. Treatment: fluids, prokinetics, nutritional support."},
        {"id": "A12380", "title": "Bovine Ketosis", "body": "Updated December 2022. Common in dairy cows post-calving. Signs: decreased appetite, reduced milk yield, acetone odor. Treatment: IV glucose, propylene glycol drench."},
        {"id": "A12381", "title": "Ferret Insulinoma", "body": "Updated October 2021. Tumor of pancreatic beta cells. Signs: hypoglycemia, seizures, weakness. Treatment: prednisone, diazoxide, surgical removal."},
        {"id": "A12382", "title": "Canine Allergic Dermatitis", "body": "Updated May 2021. Signs: pruritus, erythema, recurrent ear infections. Causes: fleas, food allergy, atopy. Treatment: allergen avoidance, Apoquel, Cytopoint."},
        {"id": "A12383", "title": "Feline Vaccination Protocols", "body": "Updated April 2023. Core vaccines: panleukopenia, herpesvirus, calicivirus, rabies. Boosters every 1–3 years."},
        {"id": "A12384", "title": "Horse Gastric Ulcer Syndrome", "body": "Updated June 2022. Common in performance horses. Signs: poor appetite, colic, weight loss. Treatment: omeprazole, dietary management."},
        {"id": "A12385", "title": "Pig Respiratory Disease Complex", "body": "Updated August 2021. Caused by Mycoplasma hyopneumoniae + viruses. Signs: coughing, poor growth. Control: vaccination + biosecurity."},
        {"id": "A12386", "title": "Sheep Lice Infestation", "body": "Updated November 2020. External parasites cause wool loss and irritation. Control: dipping, pour-on insecticides, quarantine of new stock."},
        {"id": "A12387", "title": "Canine Leptospirosis", "body": "Updated March 2022. Zoonotic bacterial disease. Signs: fever, jaundice, kidney failure. Prevention: vaccination + rodent control."},
        {"id": "A12388", "title": "Feline Immunodeficiency Virus", "body": "Updated September 2022. Transmitted by bites. Signs: immunosuppression, secondary infections. Prevention: keeping cats indoors, testing new cats."},
        {"id": "A12389", "title": "Equine Tetanus", "body": "Updated February 2020. Caused by Clostridium tetani. Signs: muscle rigidity, prolapsed third eyelid. Prevention: vaccination every 1–3 years."},
        {"id": "A12390", "title": "Avian Psittacosis", "body": "Updated December 2021. Caused by Chlamydia psittaci. Signs: lethargy, nasal discharge, diarrhea. Zoonotic disease. Treatment: doxycycline."},
        {"id": "A12391", "title": "Guinea Pig Pododermatitis", "body": "Updated October 2022. Also called bumblefoot. Caused by poor husbandry and obesity. Signs: swollen, ulcerated feet. Treatment: antibiotics, improved bedding."},
        {"id": "A12392", "title": "Canine Distemper", "body": "Updated June 2020. Viral disease causing respiratory, GI, and neurological signs. Prevention: core vaccination in puppies and boosters."},
        {"id": "A12393", "title": "Feline Calicivirus", "body": "Updated January 2021. Causes upper respiratory infections in cats. Signs: sneezing, oral ulcers, conjunctivitis. Prevention: vaccination."},
        {"id": "A12394", "title": "Horse EPM (Equine Protozoal Myeloencephalitis)", "body": "Updated July 2021. Caused by Sarcocystis neurona. Signs: ataxia, weakness, muscle wasting. Treatment: antiprotozoals like ponazuril."},
        {"id": "A12395", "title": "Bovine Foot and Mouth Disease", "body": "Updated April 2020. Highly contagious viral disease. Signs: fever, vesicles on mouth and feet, lameness. Control: vaccination and movement restrictions."},
        {"id": "A12396", "title": "Goat Caseous Lymphadenitis", "body": "Updated February 2021. Caused by Corynebacterium pseudotuberculosis. Signs: abscesses in lymph nodes. Control: culling, vaccination, hygiene."},
        {"id": "A12397", "title": "Sheep Bluetongue Virus", "body": "Updated September 2020. Vector-borne disease spread by midges. Signs: fever, oral ulcers, lameness. Control: vaccination where available."},
        {"id": "A12398", "title": "Canine Pyometra", "body": "Updated December 2022. Life-threatening uterine infection in unspayed females. Signs: PU/PD, purulent discharge, lethargy. Treatment: spay surgery + IV fluids."},
        {"id": "A12399", "title": "Feline Hypertrophic Cardiomyopathy", "body": "Updated May 2021. Most common heart disease in cats. Signs: murmurs, dyspnea, thromboembolism. Treatment: beta-blockers, ACE inhibitors, anticoagulants."},
        {"id": "A12400", "title": "Equine Cushings Disease", "body": "Updated August 2022. Also called PPID. Signs: long curly coat, laminitis, weight loss. Treatment: pergolide (Prascend)."},
        {"id": "A12401", "title": "Rabbit Myxomatosis", "body": "Updated March 2021. Viral disease spread by insects. Signs: swelling of eyelids, nodules, respiratory distress. Prevention: vaccination."},
        {"id": "A12402", "title": "Bovine Lameness Management", "body": "Updated July 2022. Common causes include digital dermatitis, sole ulcers, laminitis. Control: regular hoof trimming, improved flooring, footbaths."},
        {"id": "A12403", "title": "Ferret Lymphoma", "body": "Updated November 2022. Signs: enlarged lymph nodes, lethargy, anorexia. Treatment: chemotherapy or palliative care."},
        {"id": "A12404", "title": "Canine Tick-borne Ehrlichiosis", "body": "Updated April 2021. Caused by Ehrlichia canis. Signs: fever, lethargy, anemia. Treatment: doxycycline for 28 days."},
        {"id": "A12405", "title": "Feline Toxoplasmosis", "body": "Updated January 2023. Caused by Toxoplasma gondii. Signs: neurological issues, ocular lesions. Zoonotic. Treatment: clindamycin."},
        {"id": "A12406", "title": "Horse Heaves (Recurrent Airway Obstruction)", "body": "Updated September 2021. Similar to asthma. Signs: chronic cough, nasal discharge, abdominal effort. Management: dust-free housing, bronchodilators."},
        {"id": "A12407", "title": "Pig Gastrointestinal Parasites", "body": "Updated December 2020. Common parasites: Ascaris suum, Trichuris. Control: deworming, hygiene, pasture rotation."},
        {"id": "A12408", "title": "Sheep Orf Virus", "body": "Updated May 2020. Causes scabby lesions on lips and udders. Zoonotic. Control: vaccination and strict hygiene."},
        {"id": "A12409", "title": "Canine Gastric Dilatation-Volvulus", "body": "Updated July 2021. Emergency condition in large breed dogs. Signs: abdominal distension, unproductive retching, collapse. Requires immediate surgery."},
        {"id": "A12410", "title": "Feline Bartonella Infection", "body": "Updated March 2022. Also called Cat Scratch Disease in humans. Cats may be asymptomatic. Transmission via fleas and scratches. Treatment: azithromycin."},
        {"id": "A12411", "title": "Equine West Nile Virus", "body": "Updated October 2022. Mosquito-borne viral disease. Signs: ataxia, tremors, weakness. Prevention: vaccination."},
        {"id": "A12412", "title": "Bovine Milk Fever", "body": "Updated January 2021. Hypocalcemia in dairy cows post-calving. Signs: recumbency, tremors. Treatment: IV calcium gluconate."},
        {"id": "A12413", "title": "Guinea Pig Respiratory Infection", "body": "Updated February 2022. Common pathogens: Bordetella, Streptococcus. Signs: nasal discharge, dyspnea."},
        {"id": "A12491", "title": "Canine Osteoarthritis Advances", "body": "Updated February 2024. Latest management approaches include monoclonal antibody injections, omega-3 supplementation, and improved weight management strategies."},
        {"id": "A12492", "title": "Feline Hyperthyroidism New Therapies", "body": "Updated April 2024. Low-iodine prescription diets remain effective, but newer oral antithyroid formulations reduce side effects. Radioactive iodine therapy remains gold standard."},
        {"id": "A12493", "title": "Equine Laminitis Prevention", "body": "Updated July 2024. Digital hypothermia, insulin regulation, and dietary carbohydrate restriction are shown to reduce risk in high-risk horses."},
        {"id": "A12494", "title": "Exotic Pet Dermatology", "body": "Updated September 2024. Lizards and snakes can develop dysecdysis due to humidity issues. Recent guidelines emphasize enclosure humidity monitoring and nutritional correction."},
        {"id": "A12495", "title": "Avian Influenza – Clinic Protocols", "body": "Updated November 2024. Latest NZ guidelines recommend strict quarantine, protective clothing, and immediate reporting of suspected cases in poultry and companion birds."},
        {"id": "A12496", "title": "Canine Heartworm in New Regions", "body": "Updated January 2025. Heartworm has been reported further south due to climate shifts. Prevention protocols updated to year-round prophylaxis in warmer regions."},
        {"id": "A12497", "title": "Feline Obesity Research", "body": "Updated February 2025. New clinical trials show high-protein, high-fiber diets combined with automated feeders improve weight management and owner compliance."},
        {"id": "A12498", "title": "Rabbit Viral Hemorrhagic Disease Updates", "body": "Updated March 2025. Variant RHDV2 outbreaks continue in Oceania. New vaccine protocols reduce mortality by 85% when boosted annually."},
        {"id": "A12499", "title": "Telemedicine in Veterinary Practice", "body": "Updated April 2025. Remote consultations for follow-up care and chronic conditions now supported under new NZ veterinary regulations. Limitations remain for emergency triage."},
        {"id": "A12500", "title": "AI-assisted Diagnostic Imaging", "body": "Updated May 2025. AI image analysis tools are being piloted in small animal clinics to detect fractures, cardiac abnormalities, and subtle lung changes with >90% accuracy."}
    ]
}